{
  "_name_or_path": "briaai/RMBG-1.4",
  "architectures": [
    "BriaRMBG"
  ],
  "auto_map": {
    "AutoConfig": "MyConfig.RMBGConfig",
    "AutoModelForImageSegmentation": "briarmbg.BriaRMBG"
  },
  "custom_pipelines": {
    "image-segmentation": {
      "impl": "MyPipe.RMBGPipe",
      "pt": [
        "AutoModelForImageSegmentation"
      ],
      "tf": [],
      "type": "image"
    }
  },
  "in_ch": 3,
  "model_type": "SegformerForSemanticSegmentation",
  "out_ch": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.38.0.dev0"
}
